** Custom Frame title
#+BEGIN_SRC emacs-lisp
(setq frame-title-format
      '(buffer-file-name "%b - %f" ; File buffer
        (dired-directory dired-directory ; Dired buffer
         (revert-buffer-function "%b" ; Buffer Menu
          ("%b - Dir: " default-directory))))) ; Plain buffer 
#+END_SRC 

#+RESULTS:
| buffer-file-name | %b - %f | (dired-directory dired-directory (revert-buffer-function %b (%b - Dir:  default-directory))) |

** Putting file path in frame title 
#+BEGIN_SRC emacs-lisp
(setq frame-title-format
      '(buffer-file-name "%b - %f" ; File buffer
        (dired-directory dired-directory ; Dired buffer
         (revert-buffer-function "%b" ; Buffer Menu
          ("%b - Dir: " default-directory))))) ; Plain buffer 
#+END_SRC 

#+RESULTS:
| buffer-file-name | %b - %f | (dired-directory dired-directory (revert-buffer-function %b (%b - Dir:  default-directory))) |

** Global terminal launch binding 
 #+BEGIN_SRC emacs-lisp
 (global-set-key (kbd "C-c t") (kbd "M-& xfce4-terminal RET "))
 #+END_SRC

 #+RESULTS:
 : [134217766 120 102 99 101 52 45 116 101 114 109 105 110 97 108 13]

**  make tab key do indent first then completion.
   #+BEGIN_SRC emacs-lisp
     (defun compile-key() 
             (local-set-key [(f5)] 'recompile)
     ) 
     (add-hook 'prog-mode-hook 'compile-key)
   #+END_SRC

   #+RESULTS:
   | compile-key | rainbow-delimiters-mode |

** LSP-Java 
   #+BEGIN_SRC emacs-lisp
(require 'lsp-java)
(add-hook 'java-mode-hook #'lsp)
   #+END_SRC 

   #+RESULTS:
   | lsp | er/add-cc-mode-expansions | electric-indent-mode | (lambda nil (meghanada-mode t) (flycheck-mode 1) (setq c-basic-offset 2) (add-hook 'before-save-hook 'meghanada-code-beautify-before-save)) |
*** Emmet Mode
    #+BEGIN_SRC emacs-lisp
   (add-hook 'sgml-mode-hook #'emmet-mode) ;; Auto-start on any markup modes
   (add-hook 'css-mode-hook  #'emmet-mode) ;; enable Emmet's css abbreviation.
   (add-hook 'html-mode-hook #'emmet-mode)
   (add-hook 'js2-mode-hook  #'emmet-mode) 
  (add-hook 'php-mode-hook   #'emmet-mode) 

    #+END_SRC

    #+RESULTS:
    | emmet-mode |
** Electric indent mode hooks
   #+BEGIN_SRC emacs-lisp
  (add-hook 'c-mode-hook 'electric-indent-mode)
  (add-hook 'c++-mode-hook 'electric-indent-mode)
  (add-hook 'java-mode-hook 'electric-indent-mode)
  (add-hook 'html-mode-hook 'electric-indent-mode)
  (add-hook 'css-mode-hook 'electric-indent-mode)
   #+END_SRC

   #+RESULTS:
   | er/add-css-mode-expansions | electric-indent-mode | emmet-mode |

** Image Dired Margins  
#+BEGIN_SRC emacs-lisp
(setq image-dired-thumb-margin 5)
#+END_SRC 
#+RESULTS:
: 3
*** Org Agenda Files 
    #+BEGIN_SRC emacs-lisp 
	   (setq org-agenda-files '(
  "~/Dropbox/Sync/daily_todo.org" 
  "~/Dropbox/Sync/exercise.org" 
  "~/Dropbox/Sync/priorities.org"   
  "~/Dropbox/Sync/islam_research.org"    
  ))

    #+END_SRC

    #+RESULTS:
    | ~/Dropbox/Sync/daily_todo.org | ~/Dropbox/Sync/exercise.org | ~/Dropbox/Sync/priorities.org |

* Python Shell Interpreter
  #+BEGIN_SRC emacs-lisp
(setq python-shell-interpreter "/usr/local/bin/python3.9")
  #+END_SRC

  #+RESULTS:
  : /usr/local/bin/python3.9

